Assignment4/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
	(0 0 0)		// vertex 0


);

blocks
(
    hex (1 2 3 4 9 10 11 12) (10 10 500) simpleGrading (1 1 1)	// block 1
    
);

edges
(
    arc 5 6 (0 2 0)		// edge 1
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 2 3 4)
         );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 10 11 12)
         );
    }
    wall
    {
        type wall;
        faces
        (
            (13 14 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
